Importando o Banco de Dados

In [ ]:
import sqlite3

conn = sqlite3.connect('alunos.db')
cursor = conn.cursor()

**1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto)**

In [ ]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS alunos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome VARCHAR(200),
    idade INT,
    curso VARCHAR(30)
)
''')

**2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.**

In [ ]:
cursor.execute('INSERT INTO alunos (nome, idade, curso) VALUES ("Julia", 31, "Administração")')
cursor.execute('INSERT INTO alunos (nome, idade, curso) VALUES ("Marcela", 19, "Medicina")')
cursor.execute('INSERT INTO alunos (nome, idade, curso) VALUES ("Jessica", 22, "Quimica")')
cursor.execute('INSERT INTO alunos (nome, idade, curso) VALUES ("Ana", 34, "Jornalismo")')
cursor.execute('INSERT INTO alunos (nome, idade, curso) VALUES ("João", 18, "Engenharia")')
conn.commit()

***3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:***

1. Selecionar todos os registros da tabela "alunos".
2. Selecionar o nome e a idade dos alunos com mais de 20 anos.
3. Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.
4. Contar o número total de alunos na tabela

In [ ]:
dados = cursor.execute('SELECT * FROM alunos')
for dado in dados:
  print(dado)

(1, 'Julia', 31, 'Administração')
(2, 'Marcela', 19, 'Medicina')
(3, 'Jessica', 22, 'Quimica')
(4, 'Ana', 34, 'Jornalismo')
(5, 'João', 18, 'Engenharia')

In [ ]:
dados = cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
for dado in dados:
  print(dado)

('Julia', 31)
('Jessica', 22)
('Ana', 34)

In [ ]:
dados = cursor.execute('SELECT nome FROM alunos WHERE curso = "Engenharia" ORDER BY nome')
for dado in dados:
  print(dado)

('João',)

In [ ]:
dados = cursor.execute('SELECT COUNT(*) FROM alunos')
for dado in dados:
  print(dado)
print(f'Alunos: {dado[0]}')

(5,)
Alunos: 5

**4. Atualização e Remoção**
1. Atualize a idade de um aluno específico na tabela.
2.  Remova um aluno pelo seu ID.

In [ ]:
dados = cursor.execute('UPDATE alunos SET idade = 23 WHERE id = 3')
conn.commit()
dados = cursor.execute('SELECT * FROM alunos WHERE id = 3')
for dado in dados:
  print(dado)

(3, 'Jessica', 23, 'Quimica')

In [ ]:
dados = cursor.execute('DELETE FROM alunos WHERE id = 2')
conn.commit()
dados = cursor.execute('SELECT * FROM alunos')
for dado in dados:
  print(dado)

(1, 'Julia', 31, 'Administração')
(3, 'Jessica', 23, 'Quimica')
(4, 'Ana', 34, 'Jornalismo')
(5, 'João', 18, 'Engenharia')

**5. Criar uma Tabela e Inserir Dados
Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.**

In [ ]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS clientes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome VARCHAR(100),
    idade INT,
    saldo FLOAT
)
''')

In [ ]:
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Luiza', 28, 1000)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Lucas', 38, 450.72)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Mariana', 21, 5031.01)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Paulo', 18, 531.51)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Tatiane', 56, 6650.10)")
conn.commit()

**6. Consultas e Funções Agregadas
Escreva consultas SQL para realizar as seguintes tarefas:**
1. Selecione o nome e a idade dos clientes com idade superior a
30 anos.
2. Calcule o saldo médio dos clientes.
3. Encontre o cliente com o saldo máximo.
4. Conte quantos clientes têm saldo acima de 1000.

In [ ]:
cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
for dado in cursor.fetchall():
  print(dado)

('Lucas', 38)
('Tatiane', 56)

In [ ]:
dados = cursor.execute('SELECT AVG(saldo) FROM clientes')
for dado in dados:
  print(f'A média de saldo dos clientes é de R$ {dado[0]:.2f}')

A média de saldo dos clientes é de R$ 2732.67

In [ ]:
dados = cursor.execute('SELECT * FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes)')
for dado in dados:
  print(f'O cliente com maior saldo é {dado[1]}')

O cliente com maior saldo é Tatiane

In [ ]:
dados = cursor.execute("SELECT COUNT(*) FROM clientes WHERE saldo > 1000")
for dado in dados:
    print(f'Clientes com saldo superior à R$1000: {dado[0]}')

Clientes com saldo superior à R$1000: 2

**7. Atualização e Remoção com Condições**
1. Atualize o saldo de um cliente específico.
2. Remova um cliente pelo seu ID.

In [ ]:
cursor.execute("UPDATE clientes SET saldo = 25000 WHERE id = 1")
conn.commit()
dados = cursor.execute("SELECT * FROM clientes WHERE id = 1")
for dado in dados:
  print(dado)

(1, 'Luiza', 28, 25000.0)

In [ ]:
#cursor.execute('DELETE FROM clientes WHERE id = 2')
#conn.commit()
#dados = cursor.execute('SELECT * FROM clientes')
for dado in dados:
  print(dado)

(1, 'Luiza', 28, 25000.0)
(3, 'Mariana', 21, 5031.01)
(4, 'Paulo', 18, 531.51)
(5, 'Tatiane', 56, 6650.1)

**8. Junção de Tabelas
Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.**

In [ ]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS compras (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cliente_id INTEGER,
    produto VARCHAR(100),
    valor REAL,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
)
''')

In [ ]:
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (1, 'Televisão', 2500.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (2, 'Livro', 30.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (3, 'Tablet', 800.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (4, 'Papel', 00.40)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (5, 'Bola', 200.00)")

conn.commit()

dados = cursor.execute('SELECT clientes.nome, compras.produto, compras.valor FROM clientes INNER JOIN compras ON clientes.id = compras.cliente_id')
for dado in dados:
  print(f'Nome: {dado[0]} | Produto: {dado[1]} | Valor: {dado[2]}')

Nome: Luiza | Produto: Televisão | Valor: 2500.0
Nome: Mariana | Produto: Tablet | Valor: 800.0
Nome: Paulo | Produto: Papel | Valor: 0.4
Nome: Tatiane | Produto: Bola | Valor: 200.0

In [ ]:
conn.close()